app/controllers/expenses_controller.rb

SELECT `expenses`.* FROM `expenses`
SELECT SUM(`expenses`.`amount`) AS sum_id FROM `expenses` WHERE `expenses`.`addition` = 1
SELECT `expenses`.* FROM `expenses` WHERE `expenses`.`addition` = 0
---
  def index
    @expenses = Expense.all
    @expense = Expense.new(params[:expense])
    @expenseamountspos = Expense.sum('amount', :conditions => {:addition => true})

SELECT `expenses`.* FROM `expenses` WHERE `expenses`.`id` = ? LIMIT 1  [["id", "1"]]
---
  def show
    @expense = Expense.find(params[:id])

INSERT INTO `expenses` (`addition`, `amount`, `created_at`, `item`, `updated_at`) VALUES (?, ?, ?, ?, ?)  [["addition", true], ["amount", 500], ["created_at", Thu, 11 Oct 2012 19:25:49 UTC +00:00], ["item", "PayRoll Check"], ["updated_at", Thu, 11 Oct 2012 19:25:49 UTC +00:00]]
---
  def create
    @expense = Expense.new(params[:expense])

    respond_to do |format|
      if @expense.save

SELECT `expenses`.* FROM `expenses` WHERE `expenses`.`id` = ? LIMIT 1  [["id", "1"]]
DELETE FROM `expenses` WHERE `expenses`.`id` = ?  [["id", 1]]
---
  def destroy
    @expense = Expense.find(params[:id])
    @expense.destroy